app/controllers/users_controller.rb

	def create
		@user = User.new params[:user]
		if @user.save
---
INSERT INTO `users` (`address`, `created_at`, `division_id`, `email`, `level_id`, `name`, `nik`, `password`, `status`, `telp`, `updated_at`, `username`) VALUES ('jakarta', '2013-12-24 11:00:52', 1, 'test@kmkonline.co.id', 1, 'usertest', 'KMK-0001', 'secret', 1, '0928787', '2013-12-24 11:00:52', 'testuser')

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 161 LIMIT 1
UPDATE `users` SET `email` = 'test@kmkonline.co.id', `level_id` = 1, `name` = 'usertest', `nik` = 'KMK-0001', `status` = 1, `telp` = '0928787', `username` = 'testuser', `updated_at` = '2013-12-24 11:18:25' WHERE `users`.`id` = 162

	def destroy
		@user = User.find(params[:id])
		redirect_to users_path if @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 333 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 333